TexasInstruments/c2000ware-core-sdk/driverlib/f280015x/driverlib/inc/hw_mcan.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANERR_SEC_ENABLE_SET register
//
//*************************************************************************************************
#define MCAN_ERR_SEC_ENABLE_SET_MSGMEM_ENABLE_SET   0x1U   // Message RAM SEC Interrupt Pending
                                                           // Enable Set

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANERR_SEC_ENABLE_CLR register
//
//*************************************************************************************************
#define MCAN_ERR_SEC_ENABLE_CLR_MSGMEM_ENABLE_CLR   0x1U   // Message RAM SEC Interrupt Pending
                                                           // Enable Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANERR_DED_EOI register
//
//*************************************************************************************************
#define MCAN_ERR_DED_EOI_EOI_WR   0x1U   // End of Interrupt

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANERR_DED_STATUS register
//
//*************************************************************************************************
#define MCAN_ERR_DED_STATUS_MSGMEM_PEND   0x1U   // Message RAM DED Interrupt Pending

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANERR_DED_ENABLE_SET register
//
//*************************************************************************************************
#define MCAN_ERR_DED_ENABLE_SET_MSGMEM_ENABLE_SET   0x1U   // Message RAM DED Interrupt Pending
                                                           // Enable Set

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANERR_DED_ENABLE_CLR register
//
//*************************************************************************************************
#define MCAN_ERR_DED_ENABLE_CLR_MSGMEM_ENABLE_CLR   0x1U   // Message RAM DED Interrupt Pending
                                                           // Enable Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANERR_AGGR_ENABLE_SET register
//
//*************************************************************************************************
#define MCAN_ERR_AGGR_ENABLE_SET_ENABLE_PARITY_SET    0x1U   // Enable Parity Errors Set
#define MCAN_ERR_AGGR_ENABLE_SET_ENABLE_TIMEOUT_SET   0x2U   // Enable Timeout Errors Set

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANERR_AGGR_ENABLE_CLR register
//
//*************************************************************************************************
#define MCAN_ERR_AGGR_ENABLE_CLR_ENABLE_PARITY_CLR    0x1U   // Enable Parity Errors Clear
#define MCAN_ERR_AGGR_ENABLE_CLR_ENABLE_TIMEOUT_CLR   0x2U   // Enable Timeout Errors Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANERR_AGGR_STATUS_SET register
//
//*************************************************************************************************
#define MCAN_ERR_AGGR_STATUS_SET_AGGR_PARITY_ERR_S   0U
#define MCAN_ERR_AGGR_STATUS_SET_AGGR_PARITY_ERR_M   0x3U   // Aggregator Parity Error Status
#define MCAN_ERR_AGGR_STATUS_SET_SVBUS_TIMEOUT_S     2U
#define MCAN_ERR_AGGR_STATUS_SET_SVBUS_TIMEOUT_M     0xCU   // Aggregator Serial VBUS Timeout Error
                                                            // Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANERR_AGGR_STATUS_CLR register
//
//*************************************************************************************************
#define MCAN_ERR_AGGR_STATUS_CLR_AGGR_PARITY_ERR_S   0U
#define MCAN_ERR_AGGR_STATUS_CLR_AGGR_PARITY_ERR_M   0x3U   // Aggregator Parity Error Status
#define MCAN_ERR_AGGR_STATUS_CLR_SVBUS_TIMEOUT_S     2U
#define MCAN_ERR_AGGR_STATUS_CLR_SVBUS_TIMEOUT_M     0xCU   // Aggregator Serial VBUS Timeout Error
                                                            // Status



#endif
